{"pages":[],"posts":[{"title":"UX &amp; UI APP | UX Report（1）","text":"UX stands for user experience. User experience refers to the user’s subjective feelings and satisfaction of needs when using and interacting with the product. UX reports are reasonable predictions and analyses that user experience designers make between users and systems based on data, emotion, and user research. User researches Demographic According to a survey report on part-time jobs of American college students released by China news service, since 2012, the proportion of part-time jobs among American college students has reached 73 percent, and by 2015, 85 percent of American college students are doing part-time jobs. The majority of students are willing to take a part-time job. Contemporary college students to the two biggest part-time demand: earn living expenses and exercise ability. College students began to take the initiative to make plans for their careers and spare time. Making money is still one of the important purposes, and post-1995 college students are eager to put their knowledge into practice and make money with their majors. Liu chuanyu, vice President of China’s leading website kuiwei, said most weike are still part-time, with the post-80s and post-90s generation accounting for more than 60 percent of the population. For many young students and professionals, it’s a great way to learn and test your abilities. To sum up, our main target group is college students who have certain professional skills and want to exercise this ability so as to earn some living expenses. Persona Empathy mapsEmpathy Map is a shareable visualization of “who is the user”. Its benefits include two aspects: 1) Keep the team’s understanding of users consistent;2) Achieve “user-centric” design decision. The picture below is the empathy map of this project. Information Architecture WHY IS USER EXPERIENCE (UX) IMPORTANT? There are three reasons below to explain this question. Increase customer satisfaction Enhance your customer satisfaction by improving the usability and pleasure of interacting with all touch points across platforms and devices. Understand your audiences By conducting UX research, you will gain insights into how a user behave and react to your products and services. The same website design can be just nice for users in the USA; not complicated enough for users in China or Japan; but too complicated for users in Indonesia at the same time. This difference in perception of user experience across countries and regions has prompted some global e-commerce brands to release different website designs catering to the specific markets. Good UX is good business An investment in UX sees a lower cost of customer acquisition, lower support cost, increased customer retention and increased market share. However, as a UX professional, you should be aware that design is more than appearance. Steve Jobs once said that design is not just what it looks like and feels like; design is how it works. UX design comprises UX elements from information architecture, visual design, interaction design, content strategy to sitemaps. After gaining more understanding of your users from research, you can first create a set of personas, storyboards, user journey map and ecosystem map.","link":"/2020/06/01/UX-UI/"},{"title":"Introduction","text":"Postgraduate study is coming to an end. In order to supervise my study and share my research results, I will show the progress and completion of major projects here. FMP ContractProject TitleUX Design of Web and App of Wit-Exp Project DescriptionIn recent years, there has been much discussion about witkey and the gig economy. In 2015, Preston University professor Alan Kruger and Harvard University professor Lawrence Katz pointed out in the paper that the nature of work is changing. With the help of the task platform application, people can make a living by doing odd jobs. Wit-exp, a witkey platform, it means “wisdom exponential”. The term “Witkey” comes from the English Witkey, also the abbreviation of the key of wisdom, specifically refers to those who convert their wisdom, knowledge and ability into actual income through the Internet. This app is mainly for students with certain technical ability to use their professional knowledge to earn some living expenses in their spare time and exercise their ability. Furthermore, because of covid-19, the source of income has become an issue for those who are requested to stay at home. To some extent, this issue could be solved by Wit-exp. The core of this project is to design the user experience of this app and develop a wechat mini program. In general, good design can attract and keep users. Adequate research and analysis is needed in the selection of content, colour, size, and dynamic effects. For this project combined with the current situation of contemporary society, which means that the development of this project is worth to be expected. Project Deliverables Industry feedback and evidence of feed forward mechanism within project. Student blog with relevant project activity. Every student must maintain this pertinent to the project. UX &amp; UI App Develop a Wechat Mini Program Make a short video to introduce how the program work Media Package Contract demo","link":"/2020/06/01/Introduce/"},{"title":"UX &amp; UI APP | UX Report（2）","text":"WireframesWireframes are an important step of the user-centered design process because they force designers to focus on function. The wireframes of this project took 3 days and the design were shown according to the number of days in turn. Day one Day two Day three","link":"/2020/06/03/UX-UI-APP-UX-Report%EF%BC%882%EF%BC%89/"}],"tags":[{"name":"FMP","slug":"FMP","link":"/tags/FMP/"},{"name":"project","slug":"project","link":"/tags/project/"},{"name":"UX","slug":"UX","link":"/tags/UX/"},{"name":"Design","slug":"Design","link":"/tags/Design/"},{"name":"App","slug":"App","link":"/tags/App/"},{"name":"Persona","slug":"Persona","link":"/tags/Persona/"},{"name":"GUI","slug":"GUI","link":"/tags/GUI/"},{"name":"Empathy map","slug":"Empathy-map","link":"/tags/Empathy-map/"},{"name":"Postgraduate","slug":"Postgraduate","link":"/tags/Postgraduate/"},{"name":"contract","slug":"contract","link":"/tags/contract/"},{"name":"design","slug":"design","link":"/tags/design/"},{"name":"Wireframe","slug":"Wireframe","link":"/tags/Wireframe/"}],"categories":[{"name":"Idea","slug":"Idea","link":"/categories/Idea/"},{"name":"Report","slug":"Report","link":"/categories/Report/"},{"name":"Design","slug":"Report/Design","link":"/categories/Report/Design/"},{"name":"Research","slug":"Report/Research","link":"/categories/Report/Research/"}]}