{"pages":[],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/05/29/hello-world/"},{"title":"Introduction","text":"Postgraduate study is coming to an end. In order to supervise my study and share my research results, I will show the progress and completion of major projects here. FMP ContractProject TitleUX Design of Web and App of Wit-Exp Project DescriptionIn recent years, there has been much discussion about witkey and the gig economy. In 2015, Preston University professor Alan Kruger and Harvard University professor Lawrence Katz pointed out in the paper that the nature of work is changing. With the help of the task platform application, people can make a living by doing odd jobs. Wit-exp, a witkey platform, it means “wisdom exponential”. The term “Witkey” comes from the English Witkey, also the abbreviation of the key of wisdom, specifically refers to those who convert their wisdom, knowledge and ability into actual income through the Internet. This app is mainly for students with certain technical ability to use their professional knowledge to earn some living expenses in their spare time and exercise their ability. Furthermore, because of covid-19, the source of income has become an issue for those who are requested to stay at home. To some extent, this issue could be solved by Wit-exp. The core of this project is to design the user experience of this app and the page design of the official website. In general, good design can attract and keep users. Adequate research and analysis is needed in the selection of content, colour, size, and dynamic effects. For this project combined with the current situation of contemporary society, which means that the development of this project is worth to be expected. Project Deliverables Industry feedback and evidence of feed forward mechanism within project. Student blog with relevant project activity. Every student must maintain this pertinent to the project. UX &amp; UI App Make a short video to introduce how the app work Web design and development Media Package Contract demo","link":"/2020/05/31/Introduction/"},{"title":"UX &amp; UI APP | UX Report（1）","text":"UX stands for user experience. User experience refers to the user’s subjective feelings and satisfaction of needs when using and interacting with the product. UX reports are reasonable predictions and analyses that user experience designers make between users and systems based on data, emotion, and user research. User researches Demographic Persona Empathy mapsInformation ArchitectureWireframesGUISite map","link":"/2020/05/31/UX-UI-APP-1/"}],"tags":[{"name":"FMP","slug":"FMP","link":"/tags/FMP/"},{"name":"project","slug":"project","link":"/tags/project/"},{"name":"deliverables","slug":"deliverables","link":"/tags/deliverables/"},{"name":"postgraduate","slug":"postgraduate","link":"/tags/postgraduate/"},{"name":"witkey","slug":"witkey","link":"/tags/witkey/"},{"name":"UX","slug":"UX","link":"/tags/UX/"},{"name":"Design","slug":"Design","link":"/tags/Design/"},{"name":"User","slug":"User","link":"/tags/User/"}],"categories":[{"name":"Idea","slug":"Idea","link":"/categories/Idea/"},{"name":"Research","slug":"Research","link":"/categories/Research/"},{"name":"Data","slug":"Research/Data","link":"/categories/Research/Data/"}]}